podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN2_S32K14x.svd.xml
            <cluster>
               <dim>16</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>MB,@p@f@i</name>
               <addressOffset>0x80</addressOffset>
               <register>
                  <name>CS</name>
                  <description>Message Buffer 0 CS Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TIME_STAMP</name>
                        <description>Free-Running Counter Time stamp. This 16-bit field is a copy of the Free-Running Timer, captured for Tx and Rx frames at the time when the beginning of the Identifier field appears on the CAN bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DLC</name>
                        <description>Length of the data to be stored/transmitted</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RTR</name>
                        <description>Remote Transmission Request. One/zero for remote/data frame</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>IDE</name>
                        <description>ID Extended. One/zero for extended/standard format frame</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SRR</name>
                        <description>Substitute Remote Request. Contains a fixed recessive bit</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CODE</name>
                        <description>Reserved</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ID</name>
                  <description>Message Buffer 0 ID Register</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>EXT</name>
                        <description>Contains extended (LOW word) identifier of message buffer</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>18</bitWidth>
                     </field>
                     <field>
                        <name>STD</name>
                        <description>Contains standard/extended (HIGH word) identifier of message buffer</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                     <field>
                        <name>PRIO</name>
                        <description>Local priority. This 3-bit fieldis only used when LPRIO_EN bit is set in MCR and it only makes sense for Tx buffers. These bits are not transmitted. They are appended to the regular ID to define the transmission priority</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD0</name>
                  <description>Message Buffer 0 WORD0 Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_3</name>
                        <description>Data byte 3 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_2</name>
                        <description>Data byte 2 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_1</name>
                        <description>Data byte 1 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_0</name>
                        <description>Data byte 0 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>WORD1</name>
                  <description>Message Buffer 0 WORD1 Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>DATA_BYTE_7</name>
                        <description>Data byte 7 of Rx/Tx frame</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_6</name>
                        <description>Data byte 6 of Rx/Tx frame</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_5</name>
                        <description>Data byte 5 of Rx/Tx frame</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>DATA_BYTE_4</name>
                        <description>Data byte 4 of Rx/Tx frame</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>RXIMR%s</name>
               <description>Rx Individual Mask</description>
               <addressOffset>0x880</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>MI</name>
                     <description>Individual Mask Bits</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding bit in the filter is &quot;don&apos;t care.&quot;</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding bit in the filter is checked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL1_PN</name>
               <description>Pretended Networking Control 1 Register</description>
               <addressOffset>0xB00</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>FCS</name>
                     <description>Filtering Combination Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Message ID filtering only</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Message ID filtering and payload filtering</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Message ID filtering occurring a specified number of times</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Message ID filtering and payload filtering a specified number of times</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDFS</name>
                     <description>ID Filtering Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Match upon a ID contents against an exact target value</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Match upon a ID value greater than or equal to a specified target value</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Match upon a ID value smaller than or equal to a specified target value</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Match upon a ID value inside a range, greater than or equal to a specified lower limit and smaller than or equal a specified upper limit</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLFS</name>
                     <description>Payload Filtering Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Match upon a payload contents against an exact target value</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Match upon a payload value greater than or equal to a specified target value</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Match upon a payload value smaller than or equal to a specified target value</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Match upon a payload value inside a range, greater than or equal to a specified lower limit and smaller than or equal a specified upper limit</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMATCH</name>
                     <description>Number of Messages Matching the Same Filtering Criteria</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000001</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL once before generating a wake up event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00000010</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL twice before generating a wake up event</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11111111</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL 255 times before generating a wake up event</description>
                           <value>0b11111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WUMF_MSK</name>
                     <description>Wake Up by Match Flag Mask Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Wake up match event is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up match event is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTOF_MSK</name>
                     <description>Wake Up by Timeout Flag Mask Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timeout wake up event is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timeout wake up event is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL2_PN</name>
               <description>Pretended Networking Control 2 Register</description>
               <addressOffset>0xB04</addressOffset>
               <fields>
                  <field>
                     <name>MATCHTO</name>
                     <description>Timeout for No Message Matching the Filtering Criteria</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WU_MTC</name>
               <description>Pretended Networking Wake Up Match Register</description>
               <addressOffset>0xB08</addressOffset>
               <fields>
                  <field>
                     <name>MCOUNTER</name>
                     <description>Number of Matches while in Pretended Networking</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WUMF</name>
                     <description>Wake Up by Match Flag Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No wake up by match event detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up by match event detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTOF</name>
                     <description>Wake Up by Timeout Flag Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No wake up by timeout event detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up by timeout event detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_ID1</name>
               <description>Pretended Networking ID Filter 1 Register</description>
               <addressOffset>0xB0C</addressOffset>
               <fields>
                  <field>
                     <name>FLT_ID1</name>
                     <description>ID Filter 1 for Pretended Networking filtering</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
                  <field>
                     <name>FLT_RTR</name>
                     <description>Remote Transmission Request Filter</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reject remote frame (accept data frame)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Accept remote frame</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLT_IDE</name>
                     <description>ID Extended Filter</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Accept standard frame format</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Accept extended frame format</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_DLC</name>
               <description>Pretended Networking DLC Filter Register</description>
               <addressOffset>0xB10</addressOffset>
               <resetValue>0x8</resetValue>
               <fields>
                  <field>
                     <name>FLT_DLC_HI</name>
                     <description>Upper Limit for Length of Data Bytes Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT_DLC_LO</name>
                     <description>Lower Limit for Length of Data Bytes Filter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PL1_LO</name>
               <description>Pretended Networking Payload Low Filter 1 Register</description>
               <addressOffset>0xB14</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_3</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_2</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_1</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_0</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
